# Ejemplos de ejercicios en SQL

Seleccionar únicamente los alumnos que sean de Portugal.

In [ ]:
SELECT NOM, COGNOM, DIRECCION, EMAIL FROM `Ejemplo_SQL.ALUMNOS` 
WHERE PAIS LIKE 'Portugal';

Seleccionar aquellos Masters que contengan una D. Sin embargo, debemos poner tanto %d% como D%, ya que si solo ponemos la D mayúscula solo nos cogerá aquellos Masters que contengan un D mayúscula.

In [ ]:
SELECT * FROM `Ejemplo_SQL.MASTERS`
WHERE NOM LIKE '%d%' OR NOM LIKE 'D%';

Seleccionar aquellos alumnos que tengan un ID comprendido entre 37 y 45 y que se ordenen de forma ascendente.

In [ ]:
SELECT * FROM `Ejemplo_SQL.ALUMNOS`
WHERE ID BETWEEN 37 AND 45 ORDER BY ID ASC;

Insertar un nuevo alumno. En primer lugar, debemos establecer el orden en el que se irán incluyendo los diferentes valores que vayamos aportando, de tal manera que se sincronicen con el resto de valores de la tabla que tenemos.

In [ ]:
INSERT INTO `Ejemplo_SQL.ALUMNOS`
(ID, NOM, COGNOM,PAIS, DIRECCION, EMAIL)
VALUES (100,'Darío','Fernández','España','Rincon de Ademuz', 'fernandezdario17@gmail.com');

En este caso, estamos actualizando el valor del email de aquellos alumnos que tengan un ID = 100. Como previamente le hemos dicho que yo tengo un valor de 100 en el ID que modifique mi email.

In [ ]:

UPDATE `Ejemplo_SQL.ALUMNOS`
SET EMAIL = 'dario.avatar@hotmail.com' WHERE ID = 100

En este caso, actualizamos el valor de país del alumno Darío, este caso yo. Por tanto, si previamente el país que se mostraba para el alumno Darío era España, ahora aparecerá México.

In [ ]:
UPDATE `Ejemplo_SQL.ALUMNOS`
SET PAIS = 'MEXICO' WHERE NOM = 'Darío';

En este caso, lo que queremos es que en la tabla de masters se inserte un nuevo máster llamado MDA y que tenga un ID de Máster que sea 777.

In [ ]:
INSERT INTO `Ejemplo_SQL.MASTERS`
(ID, NOM)
VALUES (777, 'MDA');

En este ejemplo lo que podemos observar es que en la tabla en la que se interrelacionan los másters y los alumnos se cree una nueva fila en la que el ID correspondiente al Alumno y el Máster sea 180 y además le indicamos los valores del alumno que previamente hemos definido. En este caso esta nueva fila con ID de 180, tenemos al Alumno que posee un ID de 100 y le indicamos que está estudiando el Máster que tiene un ID de 777, por lo tanto sabemos que es el Máster de Data.

In [ ]:
INSERT INTO `Ejemplo_SQL.ALU_MASTERS`
(ID, ALU_ID, MAS_ID)
VALUES (180, 100, 777)

En este caso lo que queremos es que nos muestre todas las columnas de la tabla de Alumnos que tengan un ID de 777. Sin embargo, no nos mostrará nada, ya que el ID 777 era el del Máster de MDA.

In [ ]:
SELECT * FROM `Ejemplo_SQL.ALUMNOS`, `Ejemplo_SQL.ALU_MASTERS`, `Ejemplo_SQL.MASTERS`
WHERE `Ejemplo_SQL.ALUMNOS`.ID = 777;

En este caso lo que queremos que nos muestre es básicamente aquellos alumnos que tengan un ID de 81.

In [ ]:
SELECT * FROM `Ejemplo_SQL.ALUMNOS`, `Ejemplo_SQL.ALU_MASTERS`, `Ejemplo_SQL.MASTERS`
WHERE `Ejemplo_SQL.ALUMNOS`.ID = 81
AND `Ejemplo_SQL.ALUMNOS`.ID = `Ejemplo_SQL.ALU_MASTERS`.ALU_ID
AND `Ejemplo_SQL.MASTERS`.ID = `Ejemplo_SQL.ALU_MASTERS`.ALU_ID;

Borrar aquellos alumnos que se llamen Juan.

In [ ]:
DELETE FROM `Ejemplo_SQL.ALUMNOS`
WHERE NOM = 'Juan';

Borrar aquellos alumnos que no estén cursando ningún Máster.
Aquí lo que hacemos básicamente es que buscando en la tabla de ALU_Masters mira quien de la tabla Alumnos no se encuentra en la de ALU_MASTERS y lo elimina de la tabla de Alumnos.

In [ ]:
DELETE FROM `Ejemplo_SQL.ALUMNOS`
WHERE ID NOT IN (SELECT ALU_ID FROM `Ejemplo_SQL.ALU_MASTERS`);

Eliminar aquelos Másters que no tengan alumnos. 
Aquí lo que le diremos es que el ID del Máster no se encuentre dentro de la tabla de ALU_MASTERS que lo elimine de la tabla de Másters.

In [ ]:
DELETE FROM `Ejemplo_SQL.MASTERS`
WHERE ID NOT IN (SELECT MAS_ID FROM `Ejemplo_SQL.ALU_MASTERS`);

Aquí tenemos que actualizar el email de los alumnos del máster de MDA a nulo.
Los pasos a realizar son los siguientes:


1.   En la primera linea le damos el comando de que actualice a nulo el email en la tabla de alumnos.
2.   En la segunda y tercera linea le decimos que el ID del alumno que se corresponda al ALU_ID y que tenga un MAS_ID que corresponda al Máster de MDA que actualice el email a NULO.

In [ ]:
UPDATE `Ejemplo_SQL.ALUMNOS` SET email = null
WHERE ID IN (SELECT ALU_ID FROM `Ejemplo_SQL.ALU_MASTERS` 
WHERE MAS_ID IN (SELECT ID FROM `Ejemplo_SQL.MASTERS` WHERE Nom = 'MDA'))